In [2]:
import numpy as np
import pandas as pd

In [3]:
data= np.array([[10,20,30],[40,50,60],[70,80,90],[100,110,120,]])
df=pd.DataFrame(data,index=['column1','column2','column3','column4'],columns=['column1','column2','column3',])
df

         column1  column2  column3
column1       10       20       30
column2       40       50       60
column3       70       80       90
column4      100      110      120

In [4]:
marks=pd.Series([30,35,40], index=["python","dbms","rdbms"]);
marks

python    30
dbms      35
rdbms     40
dtype: int64

In [5]:
d={"name":'Yana',"course":'BBA',"address":'Vadodara',}

In [6]:
student=pd.Series(d)
student

name           Yana
course          BBA
address    Vadodara
dtype: object

In [7]:
student.keys()

Index(['name', 'course', 'address'], dtype='object')

In [8]:
student.values

array(['Yana', 'BBA', 'Vadodara'], dtype=object)

In [9]:
df=pd.DataFrame(np.random.randint(1,100,(4,3)),index=['tana','aanal','lisha','misha'],columns=['ds','dca','cn'])
df

       ds  dca  cn
tana   80   49  73
aanal  22   57  15
lisha  68    1  59
misha   5    6  14

In [10]:
df["total"]=df['ds']+df['dca']+df['cn']
df

       ds  dca  cn  total
tana   80   49  73    202
aanal  22   57  15     94
lisha  68    1  59    128
misha   5    6  14     25

In [11]:
df.loc[['tana','misha']]

       ds  dca  cn  total
tana   80   49  73    202
misha   5    6  14     25

In [12]:
df.loc['lisha']

ds        68
dca        1
cn        59
total    128
Name: lisha, dtype: int32

In [13]:
df.drop('total',axis=1)

       ds  dca  cn
tana   80   49  73
aanal  22   57  15
lisha  68    1  59
misha   5    6  14

In [14]:
df

       ds  dca  cn  total
tana   80   49  73    202
aanal  22   57  15     94
lisha  68    1  59    128
misha   5    6  14     25

In [15]:
df.drop('total',axis=1,inplace=True)

In [16]:
df

       ds  dca  cn
tana   80   49  73
aanal  22   57  15
lisha  68    1  59
misha   5    6  14

In [17]:
df.drop('tana',axis=0)

       ds  dca  cn
aanal  22   57  15
lisha  68    1  59
misha   5    6  14

In [18]:
a=np.arange(26);
a

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25])

In [19]:
#Q1 Create 3 list viz. productId, Product Name, Product Price each.

In [20]:
productId=["101","102","103","104","105"]
product_name=["pen","marker","Notebook","pencil","Scissor"]
product_price=["10","20","40","10","30"]

f= {'product_Id': productId,'product_name': product_name, 'product_price': product_price}
f

{'product_Id': ['101', '102', '103', '104', '105'],
 'product_name': ['pen', 'marker', 'Notebook', 'pencil', 'Scissor'],
 'product_price': ['10', '20', '40', '10', '30']}

In [21]:

df=pd.DataFrame(f)
df

  product_Id product_name product_price
0        101          pen            10
1        102       marker            20
2        103     Notebook            40
3        104       pencil            10
4        105      Scissor            30

In [22]:
#Q2 Extract one by one column and display separately from above dataframe.

In [23]:
column1=df['product_Id']
column2=df['product_name']
column3=df['product_price']
column1,column2,column3

(0    101
 1    102
 2    103
 3    104
 4    105
 Name: product_Id, dtype: object,
 0         pen
 1      marker
 2    Notebook
 3      pencil
 4     Scissor
 Name: product_name, dtype: object,
 0    10
 1    20
 2    40
 3    10
 4    30
 Name: product_price, dtype: object)

In [24]:
#Q3 display separately each and every row from an aove dataframe.(use loc or iloc function)

In [25]:
a1=df.iloc[0]
a2=df.iloc[1]
a3=df.iloc[2]
a1,a2,a3

(product_Id       101
 product_name     pen
 product_price     10
 Name: 0, dtype: object,
 product_Id          102
 product_name     marker
 product_price        20
 Name: 1, dtype: object,
 product_Id            103
 product_name     Notebook
 product_price          40
 Name: 2, dtype: object)

In [26]:
#Q4 display product name from 3 row using loc function

In [27]:
df.loc[2,["product_name"]]

product_name    Notebook
Name: 2, dtype: object

In [28]:
df.iloc[0:3,1]

0         pen
1      marker
2    Notebook
Name: product_name, dtype: object

In [29]:
#Q5 Display price Located in 2 row using iloc function

In [30]:
df.iloc[0:3,2]

0    10
1    20
2    40
Name: product_price, dtype: object

In [31]:
#Q6 Display  2nd to 4th row data excluding price.

In [32]:
df.iloc[1:5].drop(['product_price'], axis=1)

  product_Id product_name
1        102       marker
2        103     Notebook
3        104       pencil
4        105      Scissor

In [33]:
#Q7 Display 1 to 3rd row price data only

In [34]:
df.loc[3:4,['product_price']]

  product_price
3            10
4            30

In [35]:
#Q8 Change marks in python column to 41 for students who have scored less than 40.

In [36]:
data= np.array([[14,35,14],[71,24,71],[11,34,19],[82,46,99,]])
df=pd.DataFrame(data,index=['Riya','Siya','Kiya','Jiya'],columns=['Python','Data_Science','DBMS',])
df

      Python  Data_Science  DBMS
Riya      14            35    14
Siya      71            24    71
Kiya      11            34    19
Jiya      82            46    99

In [37]:
df['Python']<40

Riya     True
Siya    False
Kiya     True
Jiya    False
Name: Python, dtype: bool

In [38]:
df.loc[df.Python<40,'Python']=41

In [39]:
df

      Python  Data_Science  DBMS
Riya      41            35    14
Siya      71            24    71
Kiya      41            34    19
Jiya      82            46    99

In [40]:
#Q9 Add 2 marks to all the subjects marks. If any of the marks exceeds 100 chage it to 100.

In [41]:
df+2

      Python  Data_Science  DBMS
Riya      43            37    16
Siya      73            26    73
Kiya      43            36    21
Jiya      84            48   101

In [42]:
df.loc[df['Python']>100,'Python']=100
df

      Python  Data_Science  DBMS
Riya      41            35    14
Siya      71            24    71
Kiya      41            34    19
Jiya      82            46    99

In [43]:
#Q10 Display students who have scored more than 50 marks in Python and more than 60 marks in DataScience

In [44]:
df.loc[df.Python>50].drop(['Data_Science'],axis=1).drop(['DBMS'],axis=1)

      Python
Siya      71
Jiya      82

In [45]:
df.loc[df.Data_Science>60]

Empty DataFrame
Columns: [Python, Data_Science, DBMS]
Index: []

In [46]:
#Q11 Display students records whose name starts with letter S.

In [47]:
df.loc?

In [48]:
#Q12 Display students records whose name ends with letter a.

In [49]:
#Q13 Calculate total and percentage for all the students.

In [50]:
df['percentage']=(df['Python']+df['Data_Science']+df['DBMS'])*1/3
df

      Python  Data_Science  DBMS  percentage
Riya      41            35    14   30.000000
Siya      71            24    71   55.333333
Kiya      41            34    19   31.333333
Jiya      82            46    99   75.666667

In [51]:
#Q14 Calculate Status (Pass/Fail) for the students.

In [52]:
df.loc[df['percentage']>40,'Result']="pass"
df.loc[df['percentage']<40,'Result']="fail"
df

      Python  Data_Science  DBMS  percentage Result
Riya      41            35    14   30.000000   fail
Siya      71            24    71   55.333333   pass
Kiya      41            34    19   31.333333   fail
Jiya      82            46    99   75.666667   pass

In [53]:
#Q15 Calculate percentage based grade value (per>=90then A-grade,per>=80 then B-grade, per>=70 then C-grade, per>=60 then D-grade, per>=50 then E-grade, per<50 then F grade)

In [54]:
df.loc[df['percentage']>=90,'Grade']="A"
df.loc[df['percentage']>=80,'Grade']="B"
df.loc[df['percentage']>=70,'Grade']="C"
df.loc[df['percentage']>=60,'Grade']="D"
df.loc[df['percentage']>=50,'Grade']="E"
df.loc[df['percentage']<50,'Grade']="F"
df

      Python  Data_Science  DBMS  percentage Result Grade
Riya      41            35    14   30.000000   fail     F
Siya      71            24    71   55.333333   pass     E
Kiya      41            34    19   31.333333   fail     F
Jiya      82            46    99   75.666667   pass     E

In [ ]:
#Q16 Also calculate overall columns total, maximum, minmum and standard deviation for each numeric columns

In [ ]:
df.describe

In [ ]:
#Q17 Display meta-data for each column for the above dataframe.

In [ ]:
df.dtypes

In [54]:
#Q18 Convert the above dataframe to list within a dictionary.

In [ ]:
df.todictionary

In [ ]:
#Q19 Convert this dictionary again to a separate dataframe by adding 500 to each element in product price column

In [ ]:
df.+500

In [ ]:
#Method name : - df.isnull(), df.notnull(),df.dropna(removes where the value is null(axis=1 for column))

#df.dropna(thresh=2)remove any number excide the given number

#df.fillna(value=5)to fill the null data
#df.pad(It doesn't gets used now)
#df.interpolate(fill the number between upper data and lower data)

#Groupby